"""
Выполнение практических заданий к уроку №1 Python-start.
Студент: Максим Сапунов Jenny6199@yandex.ru

Задача №1. Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и строк и
сохраните в переменные, выведите их на экран.
"""
name = 'Maxim'
surname = 'Sapunov'
age = 37
gender = 'male'
position = 1

duration = input('Как долго вы в IT? :')
city = input('Из какого Вы города? :')

print('name: ', name)
print('surname: ', surname)
print('age: ', age)
print('gender: ', gender)
print('position: ', position)
print('duration: ', duration)
print('city: ', city)
